#!/usr/bin/env python
# -*- coding: UTF-8 -*-
import random
import string
import time
from utils.cryption_util import md5_encrypt
from utils.personal_util import fake, get_mobile_no


def random_string(n):
    return ''.join(random.choices(string.ascii_lowercase, k=n))


def select_nums(origin_list: list, num: int):
    target_list = []
    i = 0
    for _ in range(num):
        target_list.append(random.choice(origin_list))
    print(f"select_nums::target_list:{target_list}")
    return target_list


def get_app(name=None, pkg=None, update_time=None):
    return {
        "install_time": 1726277861758,
        "name": fake.name() if name is None else name,
        "packageName": f"com.testpkg.{random_string(6) if pkg is None else pkg}",
        "update_time": int(time.time() * 1000) if update_time is None else update_time ,
        "version": "7.9.5"
    }


def get_contact(name=None, mobile_no=None):
    phone = get_mobile_no() if mobile_no is None else mobile_no
    contact_name = fake.name() if name is None else name
    return {
        "name": md5_encrypt(contact_name),
        "phone": md5_encrypt(phone),
        # 手机号后四位修改为*
        "phone_mask": str(phone)[:-4] + '****' ,
        "name_org": contact_name
    }


def get_contact_list(
        agent_nums=2, cash_nums=3, loan_nums=4, dunning_nums=5, pyramid_nums=6, gamble_nums=3,
        drug_nums=4, yellow_nums=3, black_nums=2):
    contact_data = []
    agent_contact_list = [
        '卡中介', '贷款中介', '借贷中介', '信贷代理', '金融中介', '秒放款', '高利贷', '做网贷', '放款', 'gaolidai','kazhongjie'
    ]
    cash_contact_List = [
        '套现', '资金转移', '违规操作', '代还', '养卡', '套公积金', '取现', '提现', '刷卡机', '信用宝', '够范钱包', '瑞银信',
        'pos', 'taoxian', 'quxian', 'tixian'
    ]
    loan_contact_list = [
        '借', '贷', '办卡', '分期', '提额', '过桥', '私借', '私贷', '垫还', '垫资', '放水', '押车', '典当', '抵押',
        '担保', '空放', '0首付', '零首付', '周转', '白条', '黑户', '信用卡', '征信', '急用钱', '首逾', '捷信', '玖富',
        '宜信', '金服', '资本', '普惠', '财富', '投资', '汇融', '金融', '资产', '融资', '银行', '支行', '信合', '分行',
        '小额', 'jinrong', 'jinfu', 'puhui', 'zichan', 'rongzi', 'jiyongqian', 'daikuan', 'touzi', 'ziben', 'banka',
        'lingshoufu'
        ]
    dunning_contact_list = [
        '催收', '催债', '催账', '催死你', '催款', '崔款', '要账', '讨债', '委托催', '追债', '追贷', '逾期', '催钱',
        '人人催', '平安催'
    ]
    pyramid_contact_list = [
        '传销', '天狮', '阳光工程', '资本运作', '连锁销售', '1040', '火疗', 'MMM', '乐惠网', '拆分盘', '二元期权',
        '善心汇', '匀加速', '五行币', '九千兆', '恒星币', '亚欧币', '珍宝币', '马克币', '联融汇金', '鸿立资本',
        '融沪金融', '资瑞宝投资', '星辰金服', '森泽资产', '君德荣投资', '鑫誉汇融', '全宇投资', '嘉德融汇', '席锦投资',
        '宫玉投资', '曾舜财富', '露超投资', '鑫泰投资', '兆腾投资', '翼云投资', '盛世丰源', '雍马投资', '鑫誉汇融',
        '众帮财富', '创盈资本', '唐堡在线', '乾旺宝', '瑞徳霖投资', '蓝天投资', '君宜厚德', '星港投资', '金泽投资',
        '日化收益', '摸金派', '邮币卡', '云在指尖', '云联惠', '虚拟经济', '自愿连锁', '圣商', '爱心互助', '北部湾建设',
        '互助理财', '消费返利', '消费养老', '境外基金', '原始股投资', '电子币买卖', '静态收益', '直推奖', '层推奖',
        '对碰奖', '信掌柜', '银闪付', '容易付', '银收宝', '俏美钱包', '权健', '恒星币', '皇尊币', '金健康', '莱汇币',
        '维卡币', '无限极', '能力总管', '申购总管', '自律总管', '经晨总管', '经管二十条', '宏观调控', '视频调控',
        '三大目的', '三个目的', '商会商务', '商会商务运作', '商务运作', '人民币现象', '铺垫邀约', '大总管', '目的图',
        '目的资', '全返通', '云尊币', '云尊集团', '麦格币', '壹键哥', '盖网'
    ]
    gamble_contact_list = [
        '赌', '竞技', '博弈', '下注', '博狗', '开奖', '网投', '博彩', '菠菜', '打牌', '网牌', '牌九', '骰宝', '轮盘', '骰子',
        '骰盅', '扑克', '彩金', '金币', '筹码', '庄家', '注金', '硬币', '麻雀', '叠码', '洗码', '送码', '特码', '出码', '沓码',
        '迭码', '扒码', '搭码', '透码', '百家乐', '21点', '老虎机', '奥马哈', '斗地主', '炸金花', '接龙', '梭哈', '跑得快',
        '斗牛', '争上游', '推币机', '拉霸', '吃角子老虎', '娱乐城', '游艺场', '五花牛', '6+', '锦标赛', '城市大富翁', '博彩',
        '娱乐场', '十三张', '13张', '致富', '宾果', '戒赌', '解毒', '概率', '瘾', 'poker']
    drug_contact_list = [
        '嗑药', '吃嘎嘎', '溜冰', '出肉', '滚轱辘', '吹泡泡', '吸毒', '禁毒', '缉毒', '叶子', '海洛因', '麻古',
        '可卡因', '摇头丸', 'k粉', '大麻', '强奸药', '迷药', '性药', '抢劫药', '麻果', '春药', '情粉', '白粉', '牙签',
        '象牙棒', '兵马俑', '冰麻俑', '唠嗑药', '大力丸', '冰果', '兴奋剂', '吗啡', '鸦片', '戒毒', 'weed'
    ]
    yellow_contact_list = [
        '色情', '援交', '卖淫', '拉皮条', '炮友', '裸聊', '裸照', '封面女郎', '女优', '男奴', '应召女', '妓'
    ]
    black_contact_list = [
        '黑社会', '买枪', '卖枪', '枪支', '枪药', '步枪', '狙击枪', '气枪', '汽枪'
    ]
    contact_categories = {
        "agent":   (agent_contact_list, agent_nums),
        "cash":    (cash_contact_List, cash_nums),
        "loan":    (loan_contact_list, loan_nums),
        "dunning": (dunning_contact_list, dunning_nums),
        "pyramid": (pyramid_contact_list, pyramid_nums),
        "gamble":  (gamble_contact_list, gamble_nums),
        "drug":    (drug_contact_list, drug_nums),
        "yellow":  (yellow_contact_list, yellow_nums),
        "black":   (black_contact_list, black_nums)
    }

    # 遍历字典，批量处理
    for category, (contact_list, num) in contact_categories.items():
        contact_data.extend(get_contact(name=i) for i in select_nums(contact_list, num))
    return contact_data


def get_app_list(loan_nums=5, bank_nums=3, bet_nums=4, game_nums=5, yellow_nums=4, work_nums=3):
    app_data = []
    loans_app_list = [
        '贷款', '贷', '借', '钱', '分期', '掌柜', '融360', '爱有米', '卡牛', '51公积金', '信用', '玖富', '麦芒',
        '度小满', '借条', '花', '省呗', '国美易卡', '还呗', '还到', '借款', '分期', '贷', '融资', '周转', '普惠', '放款',
        '低息', '小额', '金服', '消金', '1156637', '12贷款记账', '2345借款王', '360信用生活', '360借呗', '360借条',
        '360借条-贷款分期借款', '360借条-贷款分期借钱', '360借条分期贷款', '360借条贷款借钱', '360借条贷款分期借款',
        '360借条贷款分期借钱', '360徣条', '360融贷款', '360贷款', '360贷款借钱借款', '360贷款分期借钱', '360贷款导航',
        '360贷款王', '369', '51信用卡贷款', '51公积金', '51公积金借款', '51公积金管家', '51分期贷款借钱', '51卡宝商务版',
        '51嗨购借钱贷款', '51征信管家', '51征信管家贷款快', '51管家', '51贷款借钱花', '51贷款管家', '51闪电购审核下款', '58分期',
        '91征信查询', '91社保查询贷款', 'E担保', 'U钱包贷款', 'e融社区', 'e融管家', 'i代', 'pp钱包', 'vivo钱包', '一计贷款计算器',
        '七星生活', '万卡猫', '万富黑卡', '不控量智推', '东海袋王', '东盟社区', '东银金融', '个人征信查询', '乐乐分期', '乐合金融',
        '乐和金融', '云商服', '享借借', '享客多', '京融钱包', '人人有信', '亿融推客', '亿融普惠', '亿袋宝', '亿财宝', '今日必下款',
        '今日金融', '仟鑫时代', '代客', '任性贷贷款', '众信飞代', '众合推客', '众微创客', '众鑫玩卡', '优智借', '优米普惠',
        '传承推客', '你我钱袋', '俏美生活', '信用360', '信用卡贷', '信用卡贷款借款', '信用卡贷款借钱', '信用查询', '信用管家借钱',
        '信用管家借钱贷款', '信用管家贷款', '信用管家－征信贷款借钱', '信用精灵', '信用花分期贷款', '信用贷款', '信福钱袋', '信贷人',
        '信贷客户端', '信贷家信贷获客', '信贷导航', '信贷牛牛获客', '信贷通', '借东风', '借了吗贷款', '借款之家', '借款王贷款借钱',
        '借点钱贷款', '借点钱贷款-小额现金借款借贷', '借点钱贷款借钱', '借购消费', '借贷王借钱', '借钱大全', '借钱用借款贷款', '兜信',
        '全网贷款', '全网贷款小额借钱', '八宝花', '公积金社保贷款', '公积金贷', '公积金贷款计算器', '凤凰智信管家',
        '分期借贷小额贷款', '分期借贷贷款', '分期借钱贷款', '分期贷款管家', '分秒借款', '创鑫金服', '别具一格', '办信用卡',
        '办客', '助力钱包贷款', '卡享时代', '卡农', '卡农社区', '卡农论坛', '卡卡窝论坛贷款', '卡卡西', '卡友之家', '卡宝钱包',
        '卡有钱商城', '卡梦金融', '卡神网', '卡诺网', '卡达圈', '印象金融', '去哪借', '去哪儿借', '友金帮', '双鱼座', '口子王',
        '口袋金', '口贷社区', '可乐花', '吉信贷', '吉派', '君子信', '品冠时代', '嗨袋', '嘉禾荣耀', '嘟嘟白卡软件', '圣女果',
        '地瓜金融VIP', '墨瑶客', '多享金汇-小额贷款', '多米乐推', '大仙金服', '大数伙伴', '大王贷款', '大额贷款', '天天快借',
        '天薪科技', '奇点易代', '奥奥钱包', '好分期贷款', '好批', '好期贷款', '好贷现金借款', '好运分期', '安鑫管家', '宝莲花',
        '容易贷信用贷款', '小Q金服', '小小金融贷款借钱', '小新优品', '小橘子', '小熊猫', '小码头', '小米贷款极速版', '小財神',
        '小闪云', '小马过河', '小鲨分期', '居惠购', '巨方金融', '帮办金融', '平安融贷', '平安钱站', '幸运分期',
        '应用商店（小米金融）', '应用市场（京东金融）', '征信-个人征信查询', '征信个人征信查询', '微享加', '微博分期', '微品分期',
        '微微钱包', '微粒借钱小额贷款', '微粒分期', '微贷借款', '微钱云', '微鼎金融', '心系天下', '心连薪', '心连薪传媒',
        '快卡官微', '快易省', '快来鼠钱', '快贷贷款', '恒优贷', '恒远', '愿望钱包', '懒财金服', '我来数科', '我爱卡', '我爱花',
        '房贷专业版', '房贷计算器2019', '房贷计算器软件', '手机借钱-现金信用贷款', '手机贷-贷款借钱借款', '手机贷贷款借钱借款',
        '招财喵', '招财推客', '指点官微', '挖财记账', '挖财钱管家', '捷顺分期', '掌上金融', '掌上钱袋', '掌中宝2.0',
        '搜狗手机助手（51公积金管家）', '搜狗手机助手（度小满金融）', '搜狗手机助手（新浪有还信用贷款）', '搜狗手机助手（期待合伙人）',
        '搜狗手机助手（省呗）', '搜狗手机助手（银谷普惠）', '搜狗手机助手（闪银贷款借钱）', '擎天柱', '斗牛钱包', '新信贷展业',
        '新浪有借大额版', '新浪有还信用贷款', '新贷款口子', '新随意花', '无花果', '无限分期', '旭日魔盒', '旺仔钱包', '易借呗',
        '易卡花', '易多多', '易富钱包', '易米推客', '易融之家', '易融国际', '易融金服', '易贷到借款', '昙花一现', '星汇贷',
        '春享花', '普惠通', '曹操管家', '月花分期', '有米到账', '有米管家借钱', '有钱还', '有额度', '有鱼借款', '有鱼粮',
        '朝阳商城', '来借钱极速版', '来推呗', '来这花', '极融', '极贷管家-贷款借钱', '极贷管家贷款借钱', '极贷管家贷款软件',
        '极速简单借', '栗子分期', '榕树分期贷款', '榕树贷款闪电借款', '樱花分期', '欧亚应急', '款少爷', '民生助粒', '汇融享客',
        '沃银分期', '法兰克', '浩源小贷', '涨盈普惠', '淘钱宝贷款', '滙通天下', '满分', '满天星', '滴滴快借', '滴滴来钱',
        '火星茶商城', '火车侠', '点点融', '点融金融', '熊大猫', '熊熊管家', '熊猫账本', '爱卡猫', '爱还', '爱钱记贷款',
        '牛牛速借', '猎豹大额分期', '猕猴桃', '王老吉', '环球黑卡', '现代管家', '现金秒贷（秒贷）', '现金联盟', '瑞e生活',
        '甘蔗汇贷款', '甜橙花', '用呗分期', '用钱袋', '电兔社保贷', '畅行花', '畅金服务', '白羊快借', '百万钱包贷款借钱',
        '百优分期', '百多金融', '百度手机助手360借条', '百度手机助手51信用卡管家', '百度手机助手51公积金管家', '百度手机助手省呗',
        '百度手机助手读秒钱包', '盛世金汇', '盛源财商', '盛隆汇总', '直推管家', '省呗借款', '省呗返利购物软件', '真享花',
        '社保公积金贷款', '神PRO_R', '福利到手', '秒享金融', '秒借极速小额借贷', '秒卡钱包', '秒快借', '秒贷款分期借钱',
        '秒速下款', '积分大师', '空手到', '立即贷借钱贷款', '立时贷借款', '简融现金贷款王', '米花金融', '糖分期', '给你花(贷款)',
        '给你花极速版', '网贷之家', '美威贷款-分期借钱', '老哥帮-借钱助手', '老哥帮借钱助手', '老哥帮小额贷款借款', '老管家',
        '老虎掘金', '考拉信用', '考拉信用极速放款', '考拉征信', '聚千金', '聚合商城', '聚牛管家', '聚福钱包', '聚融宝', '胖子有钱',
        '花借贷款借钱', '花分期呗黄金版', '花花好借', '茉莉', '荷包', '荷包Pro', '萌宝应急', '葵花宝典', '蒙蒙分期', '蓉畅通',
        '蓝银草', '薪易钱包', '蘑菇信用', '蘑菇钱包', '虾米家房贷计算器', '蚂蚁借条信用贷款', '蚂蚁借款信用分期', '蚂蚁借款分期贷款',
        '蚂蚁借款极速省呗', '蚯蚓掌金信而富捷信金融借钱', '蜻蜓旺卡', '融360', '融360信用卡', '融360信贷助手', '融360借钱',
        '融360极速版', '融360贷款', '融360速贷', '融创鑫', '融易来借钱贷款', '融易记', '豌豆云贷', '豪多鱼', '貔貅贷', '贝信分期',
        '贝壳金服', '财商之道', '财气口袋', '财湘汇', '财神口袋', '贷嘛借钱', '贷款助手', '贷款大全', '贷款平台', '赚米花',
        '赢富万卡', '超级好贷', '趣多金', '趣忧', '趣用分期贷款', '趣管账-分期贷款', '跃老板精英版', '车主贷汽车抵押贷款', '轻易借',
        '达融分期', '迎春花', '还享花', '还款分呗', '这时代', '连连普惠', '送你花', '通亿付钱包', '速借分期', '速探金融',
        '速贷之家', '速贷借呗现金贷款', '速贷现金借款贷款', '速贷现金贷款借款', '邮邮万卡', '金掌柜管家', '金满意', '金玉堂堂',
        '金融助手100', '金融微店', '金融微店-信贷获客平台', '金融微店信贷获客平台', '金融数据汇', '金融超市', '金鑫推客', '金银猪',
        '金革', '金鸟贷', '金鼠分期', '鑫财象', '鑫银家', '鑫龙宝', '钱信金融', '钱农社区', '钱包伴侣', '钱包有钱', '钱得快',
        '钱探卡包', '钱智金融', '钱站借钱', '钱酷', '银河速代', '销客赚', '销申客', '锦鲤花呗', '闪电借款极速贷款', '闪电借钱花',
        '闪电生活', '阿丽塔', '阿波罗钱包', '雪豹钱包', '露娜钱包', '青柠分期', '靖鑫金融', '顺易分期', '额度宝', '风花雪月',
        '风途时代', '飞艇易到', '飞贷', '饷钱', '马上消费金融借款管家', '马上消费金融管家', '骆驼管家', '骑士白卡', '鸟语花香',
        '麒麟財行', '黑金刚', '鼠你有钱', '鼠鼠钱'
    ]
    bank_app_list = ['银行']
    bet_app_list = [
        '赌', '竞技', '博弈', '下注', '博彩', '打牌', '骰宝', '轮盘', '骰子', '骰盅', '扑克', '彩金', '金币', '筹码',
        '庄家', '注金', '麻将', '百家乐', '21点', '老虎机', '奥马哈', '斗地主', '炸金花', '梭哈', '跑得快', '斗牛',
        '争上游', '推币机', '拉霸', '吃角子老虎', '娱乐城', '游艺场', '五花牛', '6+', '大富翁', '娱乐场', '十三张',
        '13张', '解毒', '瘾'
    ]
    game_app_list = [
        '我的世界', '和平精英', '王者', '明日之后', '猫和老鼠', '山海镜花', '皇室战争', '狂野飙车', '海岛纪元',
        '保卫萝卜', '龙之谷', '楚留香', '阴阳师', '九阴真经', '梦幻西游', '剑侠奇缘', '王国纪元', '神武',
        '卧虎藏龙', '问道', '妖精的尾巴', '侍魂胧月', '大话西游', '万王之王', '天龙八部', '完美世界', '托拉姆物',
        '轩辕剑', '大宝剑', '海岛纪元', '天神争霸', '剑舞乾坤', '未来风暴', '公主连结', '剑与', '我的女神',
        '百龙霸业', '荣耀', '霸业', '求生', '守业', '妖神记', '三国', '英雄', '冒险', '战队', '剑', '英雄',
        '战争', '封神', '炫彩', '天神', '争霸', '刀', '传奇', '航海王', '龙珠', '游戏', '王牌', '消灭', '捉妖',
        '武神', '传说', '作战', '江湖', '王国', '海战', '龙', '警察', '枪', '鬼', '妖'
    ]
    yellow_app_list = [
        '1024影院', '23PORN', '69热', '69视频', '91Porn', '91短视频', '95美女秀', '9UU', 'AVbobo', 'BeautyBox',
        'DIY101', 'FuliVideos', 'JAV99', 'Lu.Sir', 'MM131', 'MileVids', 'NANA', 'PORN', 'PaPaPa', 'PornHub', 'XXLive',
        'XXXVIDEO', 'Xvideos', 'nana', '丝瓜视频', '乐嗨秀场', '仙人掌视频', '千百撸', '卡哇伊直播167', '向日葵視頻',
        '含羞草', '咪咪', '嗨浪', '嗨碰视频', '嘿嘿连载', '嘿秀', '套路视频社交', '妖精视频', '富二代国产',
        '小姐姐直播153', '小姐姐直播154', '小玉兔', '小红帽视频', '小红苺', '小草莓', '小辣椒', '小辣椒视频',
        '小风万能播', '彩色直播', '微杏', '心之恋?', '快妖精', '快手直播伴侣', '快活视频', '快狐', '快猫VIP破解版',
        '快猫破解版', '快豹', '抖阴', '拍优云盘', '撸先生', '撸先生pro', '撸死你资源', '新金屋藏娇阁', '日币站',
        '星雨视频', '木瓜视频', '桃色视频', '樱桃视频', '欢欢新世界', '正气', '浅浅', '浪浪视频', '火爆社区', '爱私欲',
        '爱色影视频', '猫咪', '白兔云搜', '美人鱼', '羞羞涩播', '羞羞漫画', '老湿机', '自卫视频', '色猪', '色花堂',
        '色香视频', '艳图', '芭樂視頻', '花茶直播', '茄子直播', '茄子视频', '草泥马', '荔枝视频', '莲藕', '萝卜视频',
        '蚂蚁窝', '蜜桃视频', '蜜瓜', '蝌蚪®', '蝴蝶飞', '豆奶视频', '野花視頻', '野花视频', '青青草视频', '香蕉影视A',
        '香蕉視頻', '香蕉视频', '鮑魚TV', '黄瓜视频VIP', '黄瓜视频直播'
    ]
    work_app_list = [
        '职', '聘', '英才', '人才', '58同城', '赶集网', '前程无忧', '斗米', '兼职', '工作', '大街', '招工', '优秀青年',
        '人力', '往红拍', '云销', '艺嗖嗖', '找活', '谷仓众包', '新模界', '从业', '老板聊', '众工在线', '财娃',
        '工小兔', '趣多米', '面试', '俊才', '零工', '打工', '传媒人'
    ]

    loan_app_pkg_list = ['loan', 'p2p', 'credit', 'guarantee', 'fenqi']
    bet_pkg_list = ['poker', 'money']

    app_name_categories = {
        'loan': (loans_app_list, loan_nums),
        'bank': (bank_app_list, bank_nums),
        'bet': (bet_app_list, bet_nums),
        'game': (game_app_list, game_nums),
        'yellow': (yellow_app_list, yellow_nums),
        'work': (work_app_list, work_nums)
    }

    for category, (contact_list, num) in app_name_categories.items():
        app_data.extend(get_app(name=i) for i in select_nums(contact_list, num))

    app_pkg_categories = {
        'loan': (loan_app_pkg_list, loan_nums),
        'bet': (bet_pkg_list, bet_nums)
    }
    for category, (pkg_list, num) in app_pkg_categories.items():
        app_data.extend(get_app(pkg=i) for i in select_nums(pkg_list, num))
    return app_data


if __name__ == '__main__':
    print(get_contact_list(agent_nums=0, cash_nums=0, loan_nums=9, dunning_nums=0, pyramid_nums=0, gamble_nums=0,
        drug_nums=0, yellow_nums=0, black_nums=0))
    # print(get_app_list())